/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   is_valid.c                                         :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: jkimberl <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/09/23 15:41:19 by jkimberl          #+#    #+#             */
/*   Updated: 2019/09/26 12:36:28 by cchadwic         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "fillit.h"

/*
** Проверка буфера. Каждый пятый символ должен быть \n, а все остальные
** или . или #.
** так же проверяем на то что считались все 20 символов (4 строки по 5 символов
** для каждого тетрамино.
*/

int			check_buf(char *buf)
{
	int		i;
	int		n;

	i = 0;
	n = 0;
	while (buf[i])
	{
		if (buf[i] == '#')
			n++;
		if ((i % 5 != 4 && (buf[i] == '.' || buf[i] == '#')) ||
				(i % 5 == 4 && buf[i] == '\n'))
			i++;
		else
			return (0);
	}
	if (i == 20 && is_valid(buf) && n == 4)
		return (1);
	else
		return (0);
}

/*
** проверка на валидность фигуры.
** У валидной фигуры для каждой занятой клетки есть 1 или 2 занятых соседа
** общее число соприкосновений валидной фигуры равняется 6 или 8 (для квадрата)
*/

int			is_valid(char *buf)
{
	int		i;
	int		k;

	k = 0;
	i = 0;
	while (buf[i])
	{
		if (buf[i] == '#')
		{
			if (i + 1 < 19 && buf[i + 1] == '#')
				k++;
			if (i - 1 >= 0 && buf[i - 1] == '#')
				k++;
			if (i + 5 < 19 && buf[i + 5] == '#')
				k++;
			if (i - 5 >= 0 && buf[i - 5] == '#')
				k++;
		}
		i++;
	}
	return ((k == 6 || k == 8) ? 1 : 0);
}
